# Chepuha.py

print("Пожалуйста, введите слова указанной части речи.")
a1 = input("сущ. М.Р.")
a2 = input("сущ. Ж.Р.")
a3 = input("сущ. М.Р.")
a4 = input("сущ. М.Р.")
a5 = input('прил. отв. на вопрос "Какой?"')
a6 = input("сущ. М.Р.")
a7 = input("сущ. М.Р.")
a8 = input('прил. отв. на вопрос "Какая?"')
a9 = input("сущ. Ж.Р.")
a10 = input('прил. отв. на вопрос "Какую?"')
a11 = input('глагол отв. на вопрос "Что сделала с ним?"')
a12 = input("сущ. М.Р.")
a13 = input("сущ. М.Р.")
print('  Жили да были', a1, ',да', a2, 
': у них не было ни хлеба, ни соли, ни кислых щей. Пошел',a1 ,
'по сусекам скрести, по коробам мести. Собравши немного муки, стали месить'
, a3,'. На масле смесили, на сковороде прягли и на окне студили.',a3,
'соскочил да и убежал. Бежит вдоль по дорожке. Попадается ему',a4,
'навстречу и спрашивает его:\n — Куда бежишь',a3,'?\n',a3,
' ему в ответ:\n\n— Я по коробам метен,\nПо сусекам скребен,\nВ сыром масле пряжен,\nНа окошке стужен;\n',
a1,' думал съесть меня, я убежал,\n',a2,
' думала съесть меня, я убежал,\nИ от тебя убегу.\n\nИ побежал',a3,
'. Навстречу ему',a5,a6,'.\n— Куда ты,',a3,'?',a3,
' ему в ответ:\n\n— Я по коробам метен,\nПо сусекам скребен,\nВ сыром масле пряжен,\nНа окошке стужен;\n',
a1,' думал съесть меня, я убежал,\n',a2,' думала съесть меня, я убежал,\n', a4,
' думал съесть меня, я убежал,\nИ от тебя,',a6,' убегу.\n\n',a3,
' побежал. Ему навстречу попадается',a7,' и спрашивает его:\n— Куда ты,',a3,
'?',a3,' ему в ответ:\n\n— Я по коробам метен,\nПо сусекам скребен,\nВ сыром масле пряжен,\nНа окошке стужен;\n',a1,
' думал съесть меня, я убежал,\n',a2,' думала съесть меня, я убежал,\n',a4,
' думал съесть меня, я убежал,\n',a6,' думал съесть меня, я убежал,\nИ от тебя,',a7,
' убегу.\n\n',a3,' побежал. Ему навстречу попадается',a8,a9,
' баять мастерица, и спрашивает, готовясь его слизнуть:\n— Куда бежишь,',a3,
' скажи мне, ',a12, ', мой милый ',a13, '!\n',a3,
' ей в ответ:\n\n— Я по коробам метен,\nПо сусекам скребен,\nВ сыром масле пряжен,\n    На окошке стужен;\n',
a1,' думал съесть меня, я убежал,\n',
a2,' думала съесть меня, я убежал,\n',
a4,' думал съесть меня, я убежал,\n',
a6,' думал съесть меня, я убежал,\n',
a7,' думал съесть меня, я убежал,\n     И от тебя убегу.\n\n',a9,
' говорит ему:\n— Я не чую, что ты баешь? Сядь мне на',a10,
' губу!',a3,' сел, опять то же запел.— Я еще ничего не слышу! Сядь ко мне на язычок. Он и на язычок ей сел. Опять то же запел. Она — хам! — и '
,a11,' его.')
